# Представлен список чисел. Определить элементы списка, не имеющие повторений.
# Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в порядке их следования в исходном списке.
# Для выполнения задания обязательно использовать генератор.
# Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
# Результат: [23, 1, 3, 10, 4, 11]
from random import randint

n = randint(5, 15)
lst = [randint(0, 10) for _ in range(n)]
print(lst)

#print([v for v in lst if lst.count(v) == 1])
res = [v for v in lst if lst.count(v) == 1]
print(res)
