# Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].
from random import randint

n = randint(2, 20)
lst = [randint(0, 500) for _ in range(n)]
print(lst)

#print(*[lst[i] for i in range(1, n) if lst[i] > lst[i - 1]])
res = [lst[i] for i in range(1, n) if lst[i] > lst[i - 1]]
print(res)
